/* 
在一个 m*n 的棋盘的每一格都放有一个礼物，每个礼物都有一定的价值（价值大于 0）。你可以从棋盘的左上角开始拿格子里的礼物，
并每次向右或者向下移动一格、直到到达棋盘的右下角。给定一个棋盘及其上面的礼物的价值，请计算你最多能拿到多少价值的礼物？ 
*/

/**
 * @param {number[][]} grid
 * @return {number}
 */
var maxValue = function(grid) {
  const width = grid.length
  const height = grid[0].length
  const arr = new Array(width).fill(0).map(v => new Array(height).fill(0))
  for (let i = 0; i < width; i++) {
    for (let j = 0; j < height; j++) {
      if (i > 0) {
        arr[i][j] = Math.max(arr[i][j], arr[i-1][j])
      }
      if (j > 0) {
        arr[i][j] = Math.max(arr[i][j], arr[i][j-1])
      }
      arr[i][j] += grid[i][j]
    }
  }
  console.log('arr: ', arr)
  return arr[width-1][height-1]
}
const arr = [
  [5,0,1,1,2,1,0,1,3,6,3,0,7,3,3,3,1],
  [1,4,1,8,5,5,5,6,8,7,0,4,3,9,9,6,0],
  [2,8,3,3,1,6,1,4,9,0,9,2,3,3,3,8,4],
  [3,5,1,9,3,0,8,3,4,3,4,6,9,6,8,9,9],
  [3,0,7,4,6,6,4,6,8,8,9,3,8,3,9,3,4],
  [8,8,6,8,3,3,1,7,9,3,3,9,2,4,3,5,1],
  [7,1,0,4,7,8,4,6,4,2,1,3,7,8,3,5,4],
  [3,0,9,6,7,8,9,2,0,4,6,3,9,7,2,0,7],
  [8,0,8,2,6,4,4,0,9,3,8,4,0,4,7,0,4],
  [3,7,4,5,9,4,9,7,9,8,7,4,0,4,2,0,4],
  [5,9,0,1,9,1,5,9,5,5,3,4,6,9,8,5,6],
  [5,7,2,4,4,4,2,1,8,4,8,0,5,4,7,4,7],
  [9,5,8,6,4,4,3,9,8,1,1,8,7,7,3,6,9],
  [7,2,3,1,6,3,6,6,6,3,2,3,9,9,4,4,8]
]
// console.log('arr[0][0]: ', arr[0][0]);

console.log(maxValue(arr))